{
    "brookes": [
        {
            "name": "Problem Solving and Programming",
            "date": "Sep2021-Dec2021",
            "grade": "A+ (96%)",
            "text": "This module was an introduction to programming based in Python. I found this module to be remarkably easy because I already had 7 years of experince using the language by this time. I spent a lot of time helping other students with the concepts, which required me to adjust my teaching style to an older audience."
        },
        {
            "name": "Basic Communications and PC Networking",
            "date": "Sep2021-Dec2021",
            "grade": "A (70%)",
            "text": "Networking was a very content-heavy module that covered the TCP/IP and OSI models in great detail. We did a small amount of physcial networking, but mostly using the Packet Tracer simulation software."
        },
        {
            "name": "Foundations of Computer Systems",
            "date": "Sep2021-Dec2021",
            "grade": "A+ (77%)",
            "text": "This module was about how computers work. We covered binary, boolean algebra, and logic gates which I was already very familiar with, as well as some simple Assembly Language and Operating System concepts."
        },
        {
            "name": "Information Systems",
            "date": "Jan2022-May2022",
            "grade": "A+ (93%)",
            "text": "Information Systems was quite a business-y module which isn't my preferred area, but I did enjoy learning about high-level system design. Designing an Information System for an organisation requires consideration for a variety of different roles and how they interact with each other."
        },
        {
            "name": "Object-Oriented Programming",
            "date": "Jan2022-May2022",
            "grade": "A+ (98%)",
            "text": "This module covered the basic concepts of OOP such as Interfaces, Abstract Classes, Inheritance, and Polymorphism. We also looked at some basic UML and class design."
        },
        {
            "name": "DevOps",
            "date": "Jan2022-May2022",
            "grade": "A+ (84%)",
            "text": "This module looked at using Windows CMD and Bash, Testing, Debugging, Metaprogrammming, and basic Version Control with Git."
        },
        {
            "name": "Mathematics for Computing",
            "date": "Jan2022-May2022",
            "grade": "A+ (100%)",
            "text": "The purpose of this module was to catch everyone up to speed with mathematical concepts used elsewhere in the degree. My experience with A-Level Maths more than prepared me for the first several weeks, so I spent that time learning content for the last few weeks: Combinatorics and PERT Charts."
        },
        {
            "name": "Software Development in C/C++",
            "date": "Sep2022-Dec2022",
            "grade": "A+ (100%)",
            "text": "This module introduced systems-level programming concepts like pointers. We focused heavily on the syntaxes of the C and C++ programming languages. I had some experience with C++ from before university, and studied C over the summer break."
        },
        {
            "name": "Data Structures and Algorithms",
            "date": "Sep2022-Dec2022",
            "grade": "A+ (100%)",
            "text": "DSA is crucial for advanced problem solving. Over the summer break I studied some common Data Structures and Algorithms and developed a visualisation tool to help others to learn the concepts. I only shared the project with a few people in person, but I have a YouTube series that uses it and the code is available on GitHub. (See Projects tab for more)."
        },
        {
            "name": "Foundations of Security",
            "date": "Sep2022-Dec2022",
            "grade": "A (73%)",
            "text": "This module introduced some basic security concepts, such as SQL Injection, Arc Injection, Canonical Representation, Integer Overflow. I do not consider myself a Cyber Security expert, but I would say I am more aware of system vulnerabilities and risk prevention than average developers."
        },
        {
            "name": "Innovative Product Development",
            "date": "Sep2022-May2023",
            "grade": "[pending]",
            "text": "This module was a group project. Myself and 4 others were tasked with coming up with a creative idea and developing it using SCRUM. Our idea was a system that would allow tenants in shared housing to split the cost of shared items based on how much each person uses. We used Flutter, Diesel, Rocket, and Postgres. My main role was calling the backend from the Dart frontend."
        },
        {
            "name": "Foundations of Computation",
            "date": "Jan2023-May2023",
            "grade": "[pending]",
            "text": "This has been one of my favourite modules so far. DFAs, NDFAs, Formal Languages and Grammars, Pushdown Automata, Turing Machines, and Lambda Calculus; the building blocks that make modern computers possible. Some of the content has been simplified from the formal papers, but I still found it fascinating."
        },
        {
            "name": "Databases",
            "date": "Jan2023-May2023",
            "grade": "[pending]",
            "text": "This module explored data representation in XML, JSON, and CSV, as well as transformations with XSLT, and Relational Database design / implementation in MySQL."
        },
        {
            "name": "Web App Development",
            "date": "Jan2023-May2023",
            "grade": "[pending]",
            "text": "This module was tough, so I was glad I had experience with building Websites beforehand. We covered HTML, CSS, JavaScript, Python, Flask, Jinja2, SQLite, AJAX, User Sessions, SQL, Accessibility, and Responsive Design. For the coursework, we were allowed to use TypeScript and SCSS, and I opted to."
        }
    ],
    "alevel": [
        {
            "name": "Computer Science",
            "date": "Sep2019-Jun2021",
            "grade": "A*",
            "text": "Following my GSCE Computer Science result, I was determined to achieve the top grade for A-Level. My teacher advised against this, as nobody in my school had achieved A* in A-Level Computer Science previously, but I was determined. I scanned every word of the textbook, and took on an ambitious programming project Billiards. (See Projects tab for more)."
        },
        {
            "name": "Mathematics",
            "date": "Sep2019-Jun2021",
            "grade": "B",
            "text": ""
        },
        {
            "name": "Further Mathematics (AS)",
            "date": "Sep2019-Jan2021",
            "grade": "C",
            "text": ""
        },
        {
            "name": "History (AS)",
            "date": "Sep2019-Jun2020",
            "grade": "C",
            "text": ""
        }
    ]
}