[
    {
        "name": "Dark Souls",
        "author": "FromSoftware",
        "rating": "9.5/10",
        "review": "Dark Souls is a game that has not only touched the hearts of many fans, but has had a genuine impact on their lives as a whole. I am one of many that found the game in a difficult time and learned how to cope as a result. The gameplay is extremely harsh to the new player, which pushes many people away, but plays an essential role of the impact of Dark Souls. The lore is full of mysteries and deception; often the only way of finding answers is through drawing connections and seeing if it adds up.",
        "genre": "Souls-like, Dark Fantasy, RPG",
        "link": "https://en.wikipedia.org/wiki/Dark_Souls"
    },
    {
        "name": "Mass Effect (Trilogy)",
        "author": "Bioware",
        "rating": "9/10",
        "review": "The world of Mass Effect is as detailed as it is expansive. The plot carries moments of tension, triumph, and tragedy, but it's the characters that really bring this series to life. With 20 companion characters, 15 romance options, and numerous other characters from all over the galaxy combined with the branching dialogue options, there is enough content to justify several playthroughs. I played the legacy versions before Mass Effect Legendary was released, and was very impressed with the upgrades the that the remaster brought.",
        "genre": "Sci-fi, RPG, Third-Person Shooter, Choices Matter",
        "link": "https://en.wikipedia.org/wiki/Mass_Effect"
    },
    {
        "name": "Mass Effect: Andromeda",
        "author": "Bioware",
        "rating": "5.5/10",
        "review": "Mass Effect Andromeda was highly anticipated, but poorly received due to a number of technical issues and a lack of expansion. With that said, I believe that Andromeda adds to the Mass Effect series rather than taking away. The story fits well into the original, and I think that a remake would allow the game to thrive. For now, I would only recommend Mass Effect Andromeda to fans of the Mass Effect Series.",
        "genre": "Sci-fi, RPG, Third-Person Shooter",
        "link": "https://en.wikipedia.org/wiki/Mass_Effect:_Andromeda"
    },
    {
        "name": "Dishonored",
        "author": "Arkane Studios",
        "rating": "8.5/10",
        "review": "Dishonored has an interesting take on the stealth genre: getting caught does not fail the mission, but excessive aggression has an impact on the world. The level design and world building is incredible; each level has several different paths to choose from, which will show you different characters and interactions. Side missions are optional, but directly play into the main missions. The Knife of Dunwall and Brigmore Witches DLCs tell a story parallel to the base game, and the context added makes the whole package much more valuable.",
        "genre": "Stealth, Steampunk, Action",
        "link": "https://en.wikipedia.org/wiki/Dishonored"
    },
    {
        "name": "Dishonored 2",
        "author": "Arkane Studios",
        "rating": "7/10",
        "review": "Dishonored 2 takes place 15 years after its predecessor. The sequel is much more visually detailed, the world is more reactive, and there are more gameplay tools available (especially for non-lethal players). The chaos system has been modified so that stealth and aggression are both measured. Unfortunately this is where I think the complements of Dishonored 2 end; I found the storyline to be less captivating than the original, and that the graphical upgrades resulted in the unique style being largely lost. I'm also including Dishonored: Death of the Outsider in this review - largely because of the parallels with the DLC of the first game. I feel conflicted about DotO; on the one hand it answers a lot of questions raised through the series, on the other hand it may have been better for such questions to remain unsolved. Overall I would recommend Dishonored 2 and DotO to fans of the original, though I do not hold the sequel is quite so high regard.",
        "genre": "Stealth, Steampunk, Action",
        "link": "https://en.wikipedia.org/wiki/Dishonored_2"
    },
    {
        "name": "Outlast",
        "author": "Red Barrels",
        "rating": "8/10",
        "review": "Outlast was the first game that I took a deep dive in to the lore of, and the first game that I earned all of the achievements for, so it has a special place in my heart. I love that you can play through the game without really understand what is going on in the story; you have to look around and read into the details (literally, with the collectable documents) and this mirrors the goal of the protagonist: to find out what is going on in Mount Massive Asylum. As you are unable to fight back, the enemies are always threat to even the experienced player, so navigating the building is always intense. The Whistleblower DLC is a parallel story done very well: it opens with the new protagonist Waylon contacting Miles from the base game (which is the reason he went to investigate in the first place). Prominent figures in the Asylum are encountered again, and new antagonists are found in new parts of the building. I love Outlast and recommend it to anyone that can handle the horror genre.",
        "genre": "Chase Horror, Gore",
        "link": "https://en.wikipedia.org/wiki/Outlast"
    },
    {
        "name": "Outlast 2",
        "author": "Red Barrels",
        "rating": "6/10",
        "review": "Outlast 2 takes place in the same world as its predecessor, but is not a direct continuation. The protagonist and cameraman Blake joins his wife Lynn - an investigative journalist - to investigate the murder of a pregnant woman in the Arizona desert, but things very quickly go south. Outlast 2 continues the Chase Horror of the first game, but also introduces psychological horror which dives into Blake's traumatic past. Most of the game is set outside in the dark, which creates a tense atmosphere, but can be very difficult to navigate. This combined with the fact that few - if any - locations are revisited makes the word feel less memorable in my opinion. I recommend Outlast 2 to horror fans, but I can't rank it higher than the original.",
        "genre": "Chase Horror, Psychological Horror, Gore",
        "link": "https://en.wikipedia.org/wiki/Outlast_2"
    },
    {
        "name": "The Stanley Parable",
        "author": "Galactic Cafe",
        "rating": "8.5/10",
        "review": "The Stanley Parable is very difficult to describe. You play as voiceless protagonist Stanley. As you navigate the office building where Stanley works, you will be instructed to go a certain direction by the narrator. You can choose to follow or ignore the narrator. Repeatedly choosing the latter will irritate the narrator and evoke philosophical monologues. The Stanley Parable: Ultra Deluxe edition is a remaster and an extension that starts by walking through a door bluntly named \"new content\". The new content takes the game in a new, yet faithful direction. While I was playing through the Ultra Deluxe edition, my cheeks started to hurt because I could not stop smiling.",
        "genre": "Meta, Philosophical, Comedy, Choices Matter, Game Design",
        "link": "https://en.wikipedia.org/wiki/The_Stanley_Parable"
    },
    {
        "name": "The Beginner's Guide",
        "author": "Everything Unlimited Ltd.",
        "rating": "7.5/10",
        "review": "The Beginner's Guide discusses the meaning of games and game development, as well as the connection between the mind of the artist and the content of the art. The game is only about 1.5 hours in duration, so I strongly recommend anyone to play through it.",
        "genre": "Philosophical, Game Design, Walking Simulator",
        "link": "https://en.wikipedia.org/wiki/The_Beginner%27s_Guide"
    },
    {
        "name": "Portal",
        "author": "Valve",
        "rating": "7.5/10",
        "review": "Portal is an all-time classic, if you haven't played it, you should. The core concept is quite simple: you draw one doorway onto a wall, and another onto a different wall, walk through one of the doorways, and you will exit out of the other. This concept is the basis for many interesting puzzles, and creates a very satisfying movement system. The story is fairly simple: AI is in charge of a scientific testing facility and has the protagonist complete puzzles using the Portal Gun, meanwhile the protagonist wants to escape the facility. The simple story is kept engaging by the witty comments made by the AI GLaDOS throughout the game.",
        "genre": "Puzzle, Sci-fi, Platformer",
        "link": "https://en.wikipedia.org/wiki/Portal_(video_game)"
    },
    {
        "name": "Portal 2",
        "author": "Valve",
        "rating": "8.5/10",
        "review": "Portal 2 is one of the best sequels I have ever played; it took the original formula, slowly introduced a few new - yet thematically consistent - features, expanded the story in a meaningful way, and explored the history of the old setting. Portal 2 is not only a classic, but a very strong story and gameplay experience in its own right. While I would suggest playing the original first, I would recommend Portal 2, even to those that didn't enjoy Portal 1. The sequel also has a two-player mode; two pairs of portals allows for unique, and more challenging levels to enjoy with a friend. The co-op mode doesn't progress the story in a meaningful way, which means you can play with a friend that hasn't played the main games, however the lore-enthusiasts will like that it fits nicely into the storyline.",
        "genre": "Puzzle, Sci-fi, Platformer",
        "link": "https://en.wikipedia.org/wiki/Portal_(video_game)"
    },
    {
        "name": "Coffee Talk",
        "author": "Toge Productions",
        "rating": "7.5/10",
        "review": "Coffee Talk was released at the perfect time: just before the Covid-19 pandemic. I had never been especially sociable before playing, but I remember the feeling of anemoia interacting with these characters. Each character has strength, flaws, and dreams. Just like in real life, some of the characters may achieve their ambitions, only to make new ones. Upon reflection, my unexpectedly positive experience of meeting hundreds of new people at university was likely influenced by Coffee Talk. The game is very short, and perhaps a little pricy, but a brilliant experience that leaves me very excited for the sequel later this year.",
        "genre": "Visual Novel, Fantasy, Choices Matter",
        "link": "https://en.wikipedia.org/wiki/Coffee_Talk_(video_game)"
    },
    {
        "name": "Our Life: Beginnings and Always",
        "author": "GB Patch",
        "rating": "7.5/10",
        "review": "Our Life: Beginnings and Always is a Visual Novel set in 4 chunks of life: when the protagonist is aged 8, 13, 18, and 23. Our Life has a very charming story that prioritises realism over over-the-top drama. LGBTQ+ players have praised the level of inclusion that the game offers, but from my experience, it never gets in the way of good storytelling. Romance is available in later parts of the game, but it doesn't get tropey or sexual. I wouldn't necessarily recommend Our Life to people that aren't LGBTQ+, but the music, art style, atmosphere, choices, heavy themes, and joyful moments make this game a lovely experience.",
        "genre": "Visual Novel, Choices Matter, LGBTQ+",
        "link": "https://gbpatch.itch.io/our-life"
    },
    {
        "name": "Hellblade: Senua's Sacrifice",
        "author": "Ninja Theory",
        "rating": "7.5/10",
        "review": "Hellblade: Senua's Sacrifice is a Story-rich, Walking Simulator, Sword Combat game with Puzzle sections and a Norse setting. That's an eclectic style. The protagonist Senua suffers from Psychosis which offers a unique dynamic to the combat system (both genuine and false warnings from voices), as well as raising awareness for the disorder. The quality of the game is impressively high, not just graphically, but in terms of audio, puzzle creation, level design, and especially combat. The combat is extremely polished and very satisfying; it leaves me excited for the sequel. My biggest criticism of the game comes down to replayability; I played through Senua's Sacrifice twice (once blind, once to listen to all of the lore collectables and get all of the achievements); the first playthrough was brilliant, but the second didn't seem to have many new details to keep me hooked.",
        "genre": "Sword Combat, Walking Simulator, Puzzle, Norse Mythology",
        "link": "https://en.wikipedia.org/wiki/Hellblade:_Senua%27s_Sacrifice"
    },
    {
        "name": "It Takes Two",
        "author": "Hazelight Studios",
        "rating": "6.5/10",
        "review": "It Takes Two is a very charming splitscreen Co-op Puzzle game. The two characters have access to different mechanics which change over the several chapters. This provides a great deal of variety and encourages a second playthrough to experience the other abilities. The story is fairly lighthearted but has some heartwarming sections.",
        "genre": "Co-op, Puzzle, Platformer",
        "link": "https://en.wikipedia.org/wiki/It_Takes_Two_(video_game)"
    },
    {
        "name": "Life is Strange",
        "author": "Dontnod Entertainment",
        "rating": "6.5/10",
        "review": "It is not unusual for players in Choices Matter games to make a choice, then reload a save and make a different choice. Life is Strange 1 takes this idea and incorporates it into the mechanics of the game. The story explanation is time travel, which I was initially skeptical about because I had never encountered a satisfying depiction of the concept. Life is Strange makes no attempt to explain how time travel works, which I actually really appreciate, as it means the story doesn't inadvertently contradict itself. The characters are just as clueless about its nature as the player. During some scenes, the power becomes unavailable. Some have criticised this, as it can come across as a lazy way to push the plot forward. However if you consider the story as a whole, you'll notice that a lot of the situations that the ability leads to cause the main character to face something that helps her to develop as a person; that is, the power seems to exist to test her, rather than to give her what she wants but only sometimes.",
        "genre": "Slice of Life, Choices Matter, Puzzle, Horror",
        "link": "https://en.wikipedia.org/wiki/Life_Is_Strange_(video_game)"
    }
]